In [1]:
import pandas as pd
df1 = pd.DataFrame({'lkey': ['foo', 'bar', 'baz', 'foo'],
                    'value': [1, 2, 3, 5]})
df2 = pd.DataFrame({'rkey': ['foo', 'bar', 'baz', 'foo'],
                    'value': [5, 6, 7, 8]})

In [5]:
df1.merge(df2,left_on='lkey',right_on='rkey',how='right')

  lkey  value_x rkey  value_y
0  foo        1  foo        5
1  foo        5  foo        5
2  foo        1  foo        8
3  foo        5  foo        8
4  bar        2  bar        6
5  baz        3  baz        7

In [21]:
df1[list((df1.groupby('lkey')['value'].min()>=2)[df1.lkey])]

  lkey  value
1  bar      2
2  baz      3

In [25]:
df1

  lkey  value
0  foo      1
1  bar      2
2  baz      3
3  foo      5

In [24]:
df1.loc[(df1['lkey']=='foo')&(df1['value']>=2),'value']

3    5
Name: value, dtype: int64

In [15]:
cars.loc[(cars['brand']=='audi')&(cars['mpg']>50),'name']

lkey
foo    False
bar     True
baz     True
foo    False
Name: value, dtype: bool